<a href="https://colab.research.google.com/github/VitikaJain25/PandasRevision/blob/master/Merge_DataFrames.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Merge..
https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.merge.html

In [2]:
import pandas as pd
df1 = pd.DataFrame({
    "city" : ["new york", "chicago" , "orlando"],
    "temperature" : [21,14,35]
})
df1   #df1 containing Data of city and temperature

       city  temperature
0  new york           21
1   chicago           14
2   orlando           35

In [3]:
df2 = pd.DataFrame({
    "city": ["chicago","new york","orlando"],
    "humidity": [65,68,75],
})
df2     #df2 containing Data of city and humidity

       city  humidity
0   chicago        65
1  new york        68
2   orlando        75

In [4]:
#We want to join both DF to have 1 DF having city, temperature, humidity.
df3 = pd.merge(df1,df2,on = "city")
df3

# it is not just going by Row index as in concat funtion. It is looking into value of city column and performing merge.

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65
2   orlando           35        75

In [7]:
df4 = pd.DataFrame({
    "city" : ["new york", "chicago" , "orlando","baltimore"],
    "temperature" : [21,14,35,32]
})
df4  # New DF4, same as DF1, extra city added.

        city  temperature
0   new york           21
1    chicago           14
2    orlando           35
3  baltimore           32

In [8]:
df5 = pd.DataFrame({
    "city": ["chicago","new york","san francisco"],
    "humidity": [65,68,71],
})
df5     # New DF5, same as DF2, 1 city missing and 1 new city added.

            city  humidity
0        chicago        65
1       new york        68
2  san francisco        71

In [10]:
df6 = pd.merge(df4,df5,on = "city")
df6    # This will show data for only city present in both DF. It did intersection. Took only common elements.

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [11]:
df7 = pd.merge(df4,df5,on = "city",how = "outer")    #Now it will be union of both DF. It will show NaN for data which it does not have.
df7

            city  temperature  humidity
0       new york         21.0      68.0
1        chicago         14.0      65.0
2        orlando         35.0       NaN
3      baltimore         32.0       NaN
4  san francisco          NaN      71.0

In [12]:
df8 = pd.merge(df4,df5,on = "city",how = "inner")    # By default
df8

       city  temperature  humidity
0  new york           21        68
1   chicago           14        65

In [13]:
df9 = pd.merge(df4,df5,on = "city",how = "left")    # Will take all the common elements between the the 2 sets and remaming elements from the left data frame.
df9   # "san francisco" is not present as it belongs to right DF.  # df4 is left and df5 is right.

        city  temperature  humidity
0   new york           21      68.0
1    chicago           14      65.0
2    orlando           35       NaN
3  baltimore           32       NaN

In [14]:
df10 = pd.merge(df4,df5,on = "city",how = "right")    # Will take all the common elements between the the 2 sets and remaming elements from the right data frame.
df10     # baltimore and orlando not present.

            city  temperature  humidity
0       new york         21.0        68
1        chicago         14.0        65
2  san francisco          NaN        71

In [15]:
df11 = pd.merge(df4,df5,on = "city",how = "outer", indicator = True)    #To know which element came form which DF.
df11

            city  temperature  humidity      _merge
0       new york         21.0      68.0        both
1        chicago         14.0      65.0        both
2        orlando         35.0       NaN   left_only
3      baltimore         32.0       NaN   left_only
4  san francisco          NaN      71.0  right_only

In [16]:
#---------------Suffixes---------------

# If we have 2 DF with same columns. (Common columns)

dfs1 = pd.DataFrame({
    "city": ["new york","chicago","orlando", "baltimore"],
    "temperature": [21,14,35,38],
    "humidity": [65,68,71, 75]
})
dfs1

        city  humidity  temperature
0   new york        65           21
1    chicago        68           14
2    orlando        71           35
3  baltimore        75           38

In [17]:
dfs2 = pd.DataFrame({
    "city": ["chicago","new york","san diego"],
    "temperature": [21,14,35],
    "humidity": [65,68,71]
})
dfs2

        city  humidity  temperature
0    chicago        65           21
1   new york        68           14
2  san diego        71           35

In [20]:
dfs3 = pd.merge(dfs1,dfs2,on = "city")
dfs3    # It will automatically append _x and _y in the column name as both the columns exist in both DF. 
# So when it shows the merged DF, it has to differentiate between both columns.

       city  humidity_x  temperature_x  humidity_y  temperature_y
0  new york          65             21          68             14
1   chicago          68             14          65             21

In [21]:
dfs4 = pd.merge(dfs1,dfs2,on = "city", suffixes = ("_left","_right"))
dfs4   # If we want to replace _x and _y with our own suffix.

       city  humidity_left  temperature_left  humidity_right  temperature_right
0  new york             65                21              68                 14
1   chicago             68                14              65                 21